app/Controllers/PerpustakaanController.php

SELECT *
FROM `tb_buku`
 LIMIT 20, 5
SELECT COUNT(*) AS `numrows`
FROM `tb_buku`
---
    public function tampilkan_koleksi()
    {
        $db_buku = new Modelbuku();

        $data = [
            //'isi_db' => $db_buku->findAll()
            'isi_db' => $db_buku->paginate(5, 'isi_db'),

INSERT INTO `tb_buku` (`judul_buku`, `penulis`, `penerbit`, `sampul`) VALUES ('Kancil ', 'Beruang', 'nasional', '1717075646_7e76e40e9731c1198591.jpg')
---
    public function tambah_data()
    {
        $db_buku = new Modelbuku();

        $fileSampul = $this->request->getFile('fm_sampul');

        $namaSampul = $fileSampul->getRandomName();

        $fileSampul->move('sampul', $namaSampul);

        $data = [
            'judul_buku' => $this->request->getVar('fm_judul'),
            'penulis' => $this->request->getVar('fm_penulis'),
            'penerbit' => $this->request->getVar('fm_penerbit'),
            'sampul' => $namaSampul
        ];
        $db_buku->insert($data);

SELECT *
FROM `pengguna`
WHERE `id` = 'g-01'
 LIMIT 1
---
    public function aksi_login()
    {
        $data_pengguna = new Modelpengguna();
        $id_pengguna = $this->request->getVar('f_id');
        $pass_pengguna = $this->request->getVar('f_pass');
        $ambil_data = $data_pengguna->where('id', $id_pengguna)->first();